VAR_LIST = ['img_name', 'R均值', 'G均值', 'B均值', 'H均值', 'L均值', 'S均值', '灰度均值', '相对红色分量',
            '能量', '对比度', '熵', '逆方差',
            '平均尺寸', '尺寸方差', '尺寸标准差', '偏度', '峰度',
            '泡沫个数', '小泡沫个数', '中等泡沫个数', '大泡沫个数', '巨大泡沫个数',
            '承载率',
            '速度', '稳定度',
            'k+', 'Mg2+', 'SO42-', 'Cl-', 'Na+', 'time']

var_num = len(VAR_LIST) - 7
DICT_Y = {'K+': var_num, 'Mg2+': var_num + 1, 'SO42-': var_num + 2, 'Cl-': var_num + 3, 'Na+': var_num + 4}

DELETE_OUTLIER_VAR = ['R均值', 'G均值', 'B均值', 'H均值', 'L均值', 'S均值', '灰度均值', '相对红色分量',
                      '能量', '对比度', '熵', '逆方差',
                      '平均尺寸', '尺寸方差', '偏度', '峰度',
                      '泡沫个数',
                      '承载率',
                      '速度', '稳定度']